ConextCollector/src/DataProcessors/ОбработкаСправочнойИнформации/ОбработкаСправочнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаСправочнойИнформации</name>
  <attributes>
    <name>ПутьДоКаталогаСправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Платформы1С</name>
    <attributes>
      <name>Платформа</name>
      <type>
        <types>EnumRef.ВерсииПлатформы</types>
      </type>
    </attributes>
    <attributes>
      <name>КаталогСоСправкой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ConextCollector/src/Catalogs/События/События.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>События</name>
  <owners>Catalog.ВерсииТипов</owners>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConextCollector/src/Catalogs/Методы/Методы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Методы</name>
  <owners>Catalog.ВерсииТипов</owners>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтекстыВыполнения</name>
    <attributes>
      <name>Контекст</name>
      <type>
        <types>EnumRef.КонтекстыВыполнения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.Параметры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConextCollector/src/Catalogs/Перегрузки/Перегрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Перегрузки</name>
  <owners>Catalog.Методы</owners>
  <owners>Catalog.События</owners>
  <attributes>
    <name>Конструктор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Типы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConextCollector/src/DataProcessors/ОбработкаСправочнойИнформации/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ПрочитатьКнигу(ПутьДоКниги, ВерсияПлатформы) Экспорт
	
	Чтение = Обработки.ЧтениеСправки.Создать();
	ДеревоСправки = Чтение.ПрочитатьДеревоСправкиИзКниги(ПутьДоКниги);
	
	//Если Тестирование Тогда
	////ИмяФайла = "D:\DATA\Develop\1c-context\graber\tmp\дерево";
	////ЗначениеВФайл(ИмяФайла, ДеревоСправки); 
	////ДеревоСправки = ЗначениеИзФайла(ИмяФайла);
	//КонецЕсли;
	
	ОбработатьОглавление(ДеревоСправки, ВерсияПлатформы);
	ОбработатьПодчиненныеСущности(ПутьДоКниги, ВерсияПлатформы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОчиститьБазу() Экспорт
	
	Выборка = Справочники.Свойства.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка.ПолучитьОбъект().Удалить();
	КонецЦикла;
	
	Выборка = Справочники.ВерсииТипов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка.ПолучитьОбъект().Удалить();
	КонецЦикла;
	
	Выборка = Справочники.Типы.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка.ПолучитьОбъект().Удалить();
	КонецЦикла;
	
	Выборка = Справочники.События.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка.ПолучитьОбъект().Удалить();
	КонецЦикла;  
	
	Выборка = Справочники.Методы.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка.ПолучитьОбъект().Удалить();
	КонецЦикла;
	
	Выборка = Справочники.Перегрузки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка.ПолучитьОбъект().Удалить();
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьПодчиненныеСущности(ПутьДоКниги, ВерсияПлатформы)
	
	Файл = Новый Файл(ПутьДоКниги);
	БазовыйКаталог = Файл.Путь + "/shcntx_ru";
	
	ОбработатьСобытия(БазовыйКаталог, ВерсияПлатформы);
	
КонецПроцедуры

Процедура ОбработатьСобытия(БазовыйКаталог, ВерсияПлатформы)
	
	Чтец = Обработки.ЧтениеСправки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	События.Ссылка КАК Ссылка,
	|	События.ПутьКОписанию КАК ПутьКОписанию
	|ИЗ
	|	Справочник.События КАК События
	|ГДЕ
	|	События.ВерсияПлатформы = &ВерсияПлатформы";
	Запрос.УстановитьПараметр("ВерсияПлатформы", ВерсияПлатформы);
	ВыборкаСобытий = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСобытий.Следующий() Цикл
		
		ПутьКФайлу = БазовыйКаталог + ВыборкаСобытий.ПутьКОписанию;
		Определение = Чтец.ПрочитатьОпределение(ПутьКФайлу);
		
		Если Определение = Неопределено Тогда
			ОбщийМодуль.СообщитьПользователю("Не удалось прочитать описание сущности: " + ВыборкаСобытий.Ссылка);
			Продолжить;
		КонецЕсли;
		
		УдалитьПерегрузки(ВыборкаСобытий.Ссылка);
		
		СобытиеОбъект = ВыборкаСобытий.Ссылка.ПолучитьОбъект();
		СобытиеОбъект.НаименованиеАнгл = ВтороеНаименованиеИзСтроки(Определение.Заголовок); 
		СобытиеОбъект.Описание = ОписаниеСтрокойИзМассива(Определение.Описание);
		СобытиеОбъект.Записать();
		
		Для Каждого Перегрузка Из Определение.Перегрузки Цикл		
			СсылкаНаПерегрузку = НоваяПерегрузкаПоСущности(ВыборкаСобытий, Перегрузка);			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры

Функция НоваяПерегрузкаПоСущности(ВыборкаСобытий, Перегрузка)
	Элемент = Справочники.Перегрузки.СоздатьЭлемент();
	Элемент.Владелец = ВыборкаСобытий.Ссылка;
	Элемент.Наименование = Перегрузка.Вариант;
	Элемент.Конструктор = Перегрузка.Конструктор;
	Элемент.Описание = СтрСоединить(Перегрузка.Описание, Символы.ПС);
	
	Для Каждого Параметр Из Перегрузка.Параметры Цикл
		
		НоваяСтрока = Элемент.Параметры.Добавить();
		НоваяСтрока.ИмяПараметра = ИмяПараметраИзПредставления(Параметр.Представление);
		НоваяСтрока.Описание = ОписаниеСтрокойИзМассива(Параметр.Описание);
		НоваяСтрока.Обязательный = Параметр.Обязательный; 
		
		// TODO: сделай проще
		Массив = Новый Массив;
		Для Каждого Тип Из Параметр.Типы Цикл
			Массив.Добавить(Тип.Имя);	
		КонецЦикла;
		НоваяСтрока.Типы = СтрСоединить(Массив, ";");
		
	КонецЦикла;
	
	Элемент.Записать();
	Возврат Элемент.Ссылка;
КонецФункции

Функция СоздатьОбновитьТип(ВходящиеДанные, Идентификатор)
	Ссылка = Справочники.Типы.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Ссылка.Пустая() Тогда
		Элемент = Справочники.Типы.СоздатьЭлемент();
		Элемент.Наименование = ВходящиеДанные.Имя;
		Элемент.Идентификатор = Идентификатор;
		Элемент.Записать();
		
		Ссылка = Элемент.Ссылка;
	КонецЕсли;	
	Возврат Ссылка;
КонецФункции

Функция СоздатьОбновитьВерсиюТипа(ВходящиеДанные, Идентификатор, СсылкаНаТип, ВерсияПлатформы)
	СсылкаНаВерсию = ВерсияТипаПоФильтру(Идентификатор, СсылкаНаТип, ВерсияПлатформы);
	Если СсылкаНаВерсию.Пустая() Тогда
		Элемент = Справочники.ВерсииТипов.СоздатьЭлемент();
		Элемент.Идентификатор = Идентификатор;
		Элемент.Владелец = СсылкаНаТип;
		Элемент.ВерсияПлатформы = ВерсияПлатформы;
		Элемент.Наименование = СсылкаНаТип.Наименование;
		Элемент.ПутьКОписанию = ВходящиеДанные.Путь;
		Элемент.Записать();
		СсылкаНаВерсию = Элемент.Ссылка;
	КонецЕсли;
	Возврат СсылкаНаВерсию;
КонецФункции

Функция СоздатьОбновитьСвойствоТипа(ВходящиеДанные, Идентификатор, ВерсияТипа)
	
	СсылкаНаСвойство = СвойствоТипаПоФильтру(Идентификатор, ВерсияТипа, ВерсияТипа.ВерсияПлатформы);
	Если СсылкаНаСвойство.Пустая() Тогда
		Элемент = Справочники.Свойства.СоздатьЭлемент();
		Элемент.Идентификатор = Идентификатор;
		Элемент.Наименование = ВходящиеДанные.Имя;
		Элемент.Владелец = ВерсияТипа;
		Элемент.ВерсияПлатформы = ВерсияТипа.ВерсияПлатформы;
		Элемент.ПутьКОписанию = ВходящиеДанные.Путь;
		Элемент.Записать();
		
		СсылкаНаСвойство = Элемент.Ссылка;
	КонецЕсли;	
	
	Возврат СсылкаНаСвойство;
	
КонецФункции

Функция СоздатьОбновитьМетодВерсииТипа(ВходящиеДанные, Идентификатор, ВерсияТипа)
	
	СсылкаНаМетод = МетодТипаПоФильтру(Идентификатор, ВерсияТипа, ВерсияТипа.ВерсияПлатформы);
	
	Если СсылкаНаМетод.Пустая() Тогда
		Элемент = Справочники.Методы.СоздатьЭлемент();
		Элемент.Наименование = ВходящиеДанные.Имя;
		Элемент.Идентификатор = Идентификатор;
		Элемент.Владелец = ВерсияТипа; 
		Элемент.ВерсияПлатформы = ВерсияТипа.ВерсияПлатформы;
		Элемент.ПутьКОписанию = ВходящиеДанные.Путь;
		Элемент.Записать();
		
		СсылкаНаМетод = Элемент.Ссылка;
	КонецЕсли;
	
	Возврат СсылкаНаМетод;
	
КонецФункции

Функция СоздатьОбновитьСобытиеВерсииТипа(ВходящиеДанные, Идентификатор, ВерсияТипа)
	
	СсылкаНаСобытие = СобытиеТипаПоФильтру(Идентификатор, ВерсияТипа, ВерсияТипа.ВерсияПлатформы);
	Если СсылкаНаСобытие.Пустая() Тогда
		Элемент = Справочники.События.СоздатьЭлемент();
		Элемент.Наименование = ВходящиеДанные.Имя;
		Элемент.Идентификатор = Идентификатор;
		Элемент.Владелец = ВерсияТипа;
		Элемент.ВерсияПлатформы = ВерсияТипа.ВерсияПлатформы;
		Элемент.ПутьКОписанию = ВходящиеДанные.Путь;
		Элемент.Записать();
		
		СсылкаНаСобытие = Элемент.Ссылка;
	КонецЕсли;
	Возврат СсылкаНаСобытие;
	
КонецФункции

Процедура ОбработатьОглавление(Содержание, ВерсияПлатформы)
	
	Для Каждого СтрокаСодержания Из Содержание.Строки Цикл
		
		Если ЭтоКаталогОглавления(СтрокаСодержания.Путь) Тогда
			
			ОбработатьОглавление(СтрокаСодержания, ВерсияПлатформы);
			
		Иначе
			
			Идентификатор = ИдентификаторСущностиИзПути(СтрокаСодержания.Путь);
			СсылкаНаТип = СоздатьОбновитьТип(СтрокаСодержания, Идентификатор);		
			СсылкаНаВерсию = СоздатьОбновитьВерсиюТипа(СтрокаСодержания, Идентификатор, СсылкаНаТип, ВерсияПлатформы);		
			ОбработатьСодержаниеТипа(СсылкаНаТип, СсылкаНаВерсию, СтрокаСодержания);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьСодержаниеТипа(Тип, ВерсияТипа, СтрокаСодержания)
	
	Для Каждого ПодчиненныйОбъект Из СтрокаСодержания.Строки Цикл
		
		Если ЭтоКаталогОглавления(ПодчиненныйОбъект.Путь) Тогда
			
			ОбработатьСодержаниеТипа(Тип, ВерсияТипа, ПодчиненныйОбъект);
			
		ИначеЕсли ЭтоРазделСправки(ПодчиненныйОбъект, "Свойства", "properties") Тогда
			
			Коллекция = СтрокиОбходаРазделаСправки(ПодчиненныйОбъект);
			
			Для Каждого СтрокаСвойства Из Коллекция Цикл
				
				Если Не КорректноеИмяСущности(СтрокаСвойства.Имя) Тогда
					Продолжить;
				КонецЕсли;
				
				Имя = нРег(СтрокаСвойства.Имя);
				СсылкаНаСвойство = СоздатьОбновитьСвойствоТипа(СтрокаСвойства, Имя, ВерсияТипа);				
				
			КонецЦикла;
			
		ИначеЕсли ЭтоРазделСправки(ПодчиненныйОбъект, "Методы", "methods") Тогда
			
			Коллекция = СтрокиОбходаРазделаСправки(ПодчиненныйОбъект);
			Для Каждого СтрокаМетода Из Коллекция Цикл
				
				Если Не КорректноеИмяСущности(СтрокаМетода.Имя) Тогда
					Продолжить;
				КонецЕсли;
				
				Идентификатор = нРег(СтрокаМетода.Имя);			
				СсылкаНаМетод = СоздатьОбновитьМетодВерсииТипа(СтрокаМетода, Идентификатор, ВерсияТипа);
				
			КонецЦикла;
			
		ИначеЕсли ЭтоРазделСправки(ПодчиненныйОбъект, "События", "events") Тогда
						
			Коллекция = СтрокиОбходаРазделаСправки(ПодчиненныйОбъект);
			Для Каждого СтрокаСобытия Из Коллекция Цикл
				
				Если Не КорректноеИмяСущности(СтрокаСобытия.Имя) Тогда
					Продолжить;
				КонецЕсли;
				
				Идентификатор = ИдентификаторСущностиИзПути(СтрокаСобытия.Путь);		
				СсылкаНаСобытие = СоздатьОбновитьСобытиеВерсииТипа(СтрокаСобытия, Идентификатор, ВерсияТипа);
				
			КонецЦикла; 
			
		Иначе
			
			// Конструкторы
			// Параметры формы
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция КорректноеИмяСущности(Знач Значение)
	Возврат СтрНайти(Значение, "<") > 0;	
КонецФункции

Функция СтрокиОбходаРазделаСправки(ПодчиненныйОбъект)
	Коллекция = ПодчиненныйОбъект.Строки;
	Если Не ПодчиненныйОбъект.Имя = "Свойства"
		И Не ПодчиненныйОбъект.Имя = "События"
		И Не ПодчиненныйОбъект.Имя = "Методы"  Тогда
		
		Коллекция = Новый Массив;
		Коллекция.Добавить(ПодчиненныйОбъект);
		
	КонецЕсли;
	Возврат Коллекция;		
КонецФункции

Функция ЭтоРазделСправки(ПроизвольнаяСтрока, ИмяРаздела, ИмяЧастиПути)
	Возврат ПроизвольнаяСтрока.Имя = ИмяРаздела Или ЕстьЧастьПути(ПроизвольнаяСтрока.Путь, ИмяЧастиПути);
КонецФункции

Функция ИдентификаторСущностиИзПути(Знач Путь)
	
	ЧастиПути = СтрРазделить(Путь, "/");
	ИмяФайла = ЧастиПути[ЧастиПути.ВГраница()];
	Идентификатор = Лев(ИмяФайла, СтрДлина(ИмяФайла) - 5);
	Идентификатор = нРег(Идентификатор);
	Идентификатор = СтрЗаменить(Идентификатор, " ", "");
	Возврат Идентификатор;
	
КонецФункции

Функция ЕстьЧастьПути(Знач Путь, Знач ЧастьПути)
	
	// FIXME: Разделитель?
	Массив = СтрРазделить(Путь, "/");
	Возврат Массив.Найти(ЧастьПути) <> Неопределено;
	
КонецФункции

Функция ЭтоКаталогОглавления(Знач Путь)
	
	// FIXME: разделитель
	ЧастиПути = СтрРазделить(Путь, "/");
	ИмяФайла = ЧастиПути[ЧастиПути.ВГраница()];
	Возврат СтрНайти(ИмяФайла, "catalog") > 0;	
	
КонецФункции

Функция СобытиеТипаПоФильтру(Идентификатор, Владелец, Платформа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	События.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.События КАК События
	|ГДЕ
	|	События.Идентификатор = &Идентификатор
	|	И События.Владелец = &Владелец
	|	И События.ВерсияПлатформы = &Платформа";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Платформа", Платформа);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ВерсииТипов.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция МетодТипаПоФильтру(Идентификатор, Владелец, Платформа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Методы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Методы КАК Методы
	|ГДЕ
	|	Методы.Идентификатор = &Идентификатор
	|	И Методы.Владелец = &Владелец
	|	И Методы.ВерсияПлатформы = &Платформа";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Платформа", Платформа);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ВерсииТипов.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция СвойствоТипаПоФильтру(Идентификатор, Владелец, Платформа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Свойства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|ГДЕ
	|	Свойства.Идентификатор = &Идентификатор
	|	И Свойства.Владелец = &Владелец
	|	И Свойства.ВерсияПлатформы = &Платформа";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Платформа", Платформа);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ВерсииТипов.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ВерсияТипаПоФильтру(Идентификатор, Владелец, Платформа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВерсииТипов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВерсииТипов КАК ВерсииТипов
	|ГДЕ
	|	ВерсииТипов.Идентификатор = &Идентификатор
	|	И ВерсииТипов.Владелец = &Владелец
	|	И ВерсииТипов.ВерсияПлатформы = &Платформа";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Платформа", Платформа);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ВерсииТипов.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

Процедура УдалитьПерегрузки(СсылкаНаМетод)
	
	Выборка = Справочники.Перегрузки.Выбрать(, СсылкаНаМетод);
	Пока Выборка.Следующий() Цикл
		Выборка.ПолучитьОбъект().Удалить();	
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеСтрокойИзМассива(Массив)
	Значение = СтрСоединить(Массив, Символы.ПС);
	Значение = СокрЛП(Значение);
	Возврат Значение;
КонецФункции

Функция ВтороеНаименованиеИзСтроки(Строка)
	Результат = "";
	ПозицияСкобки = СтрНайти(Строка, "(");
	Если ПозицияСкобки <> 0 Тогда
		Результат = Сред(Строка, ПозицияСкобки + 1, СтрДлина(Строка) - ПозицияСкобки - 1);	
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ИмяПараметраИзПредставления(Знач Представление)
	
	Позиция = СтрНайти(Представление, ">");
	Результат = Сред(Представление, 2, Позиция - 2);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
